I've been taking a look at this and using the config you've provided above and want to double check I understand the problem correctly. Here's something I've been trying:

**Step 1 - Setup**
Apply works fine
```tf
resource "google_bigquery_dataset" "dataset" {
  dataset_id = "tf_test_my_dataset"
}

resource "google_service_account" "sa" {
  account_id = "tf-test-my-sa"
}

resource "google_bigquery_dataset_iam_member" "access" {
  dataset_id = google_bigquery_dataset.dataset.dataset_id
  role       = "roles/viewer"
  member     = "serviceAccount:${google_service_account.sa.email}"
}
```

**Step 2 - prepare for deleting the service account by hardcoding the `member` value**
This doesn't cause any diffs/is a no-op
```diff
resource "google_bigquery_dataset" "dataset" {
  dataset_id = "tf_test_my_dataset"
}

resource "google_service_account" "sa" {
  account_id = "tf-test-my-sa"
}

resource "google_bigquery_dataset_iam_member" "access" {
  dataset_id = google_bigquery_dataset.dataset.dataset_id
  role       = "roles/viewer"
-  member     = "serviceAccount:${google_service_account.sa.email}"
+  member     = "serviceAccount:tf-test-my-sa@<PROJECT_ID>.iam.gserviceaccount.com"
}
```

**Step 3 - Delete the service account**
Apply works fine, and the plan only includes removing the google_service_account resource
```tf
resource "google_bigquery_dataset" "dataset" {
  dataset_id = "tf_test_my_dataset"
}

resource "google_bigquery_dataset_iam_member" "access" {
  dataset_id = google_bigquery_dataset.dataset.dataset_id
  role       = "roles/viewer"
  member     = "serviceAccount:tf-test-my-sa@PROEJCT-ID.iam.gserviceaccount.com"
}
```

**Step 4 - run `terraform plan`**
The plan indicates that Terraform cannot see the google_bigquery_dataset_iam_member's member in the IAM binding anymore (as the entry includes `deleted` and the `uuid` now) so Terraform believes this resource needs to be recreated.
```
  # google_bigquery_dataset_iam_member.access will be created
  + resource "google_bigquery_dataset_iam_member" "access" {
      + dataset_id = "tf_test_my_dataset"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:tf-test-my-sa@<PROJECT_ID>.iam.gserviceaccount.com"
      + project    = (known after apply)
      + role       = "roles/viewer"
    }
```

**Step 5 - run `terraform apply`**
The apply fails with an error, but which error happens depends on the provider version in use.

If I use the latest Google provider release (v6.6.0) then this error is returned that mentions unknown prefix types, which I believe is the regression you are fixing:

```
│ Error: Error applying IAM policy for Bigquery Dataset <PROJECT_ID>/tf_test_sarah:
Error creating DatasetAccess: googleapi: Error 400:
IAM setPolicy failed for Dataset <PROJECT_ID>:tf_test_sarah:
The member deleted:serviceaccount:tf-test-oob-e0ybkvrluu@<PROJECT_ID>.iam.gserviceaccount.com?uid=112611438796804060811 is of an unknown type. Please set a valid type prefix for the member., invalid
│ 
│   with google_bigquery_dataset_iam_member.deleted,
│   on main.tf line 15, in resource "google_bigquery_dataset_iam_member" "deleted":
│   15: resource "google_bigquery_dataset_iam_member" "deleted" {
│ 
```

If I change which version of the Google provider I use in step 6 I see a different error.
I see the error below if I use:
* The code from your PR
* The provider version that predates https://github.com/GoogleCloudPlatform/magic-modules/pull/9948, which is v5.17.0

```
│ Error: Error applying IAM policy for Bigquery Dataset <PROJECT_ID>/tf_test_my_dataset:
Error creating DatasetAccess: googleapi: Error 400:
IAM setPolicy failed for Dataset <PROJECT_ID>:tf_test_my_dataset:
Service account tf-test-my-sa@<PROJECT_ID>.iam.gserviceaccount.com does not exist., invalid
│ 
│   with google_bigquery_dataset_iam_member.access,
│   on main.tf line 17, in resource "google_bigquery_dataset_iam_member" "access":
│   17: resource "google_bigquery_dataset_iam_member" "access" {
```

---

Do those reproduction steps sound correct, and is the fix you're doing mainly to return to that correct error message? If that's the case I can give some feedback on how to write the test to achieve this